In [1]:
import pandas as pd

In [16]:
#Q1

import pandas as pd

series = pd.Series([4,8,15,16,23,42])

print(series)
type(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

pandas.core.series.Series

In [17]:
# Q2

series = pd.Series([1,2,3,4,5,6,7,8,9,10])

print(series)
type(series)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

pandas.core.series.Series

In [21]:
#Q3

dic = {'Name' : ['Alice' , 'Bob' , 'Claire'] ,  'Age' : [25,30,27] , 'Gender' : ['Female' , 'Male' , 'Female']
      }
pd.DataFrame(dic)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

#Q4 

DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL table, or a dict of Series objects. It is generally the most commonly used pandas object.
A Series only has one data column, whereas a single-column DataFrame contains both a data column and an index. The labels for the data are contained in the index, which is a second column.

In [1]:
import pandas as pd

# Create a Pandas Series from a list
data = [1000, 2000, 3000, 4000, 5000]
s = pd.Series(data)

# Print the Series
print(s)

0    1000
1    2000
2    3000
3    4000
4    5000
dtype: int64

Q5 

Their are so many functions used for data manipulation
 for example :
 1) df.head()
 2) df.tail()
 3) df.describe()
 4) df.info() etc

In [3]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

Q6 

Series : We can change the data of a series so data of series is mutable but we can't change size so size is immutable 

dataframe : Dataframe is mutable we can change size and data both .

Panel : Panel is Mutable

In [14]:
#Q7 

# Importing Pandas library
import pandas as pd
 
# Creating two lists
author = ['Jitender', 'Purnima',
          'Arpit', 'Jyoti']
article = [210, 211, 114, 178]

author_series = pd.Series(author)
article_series = pd.Series(article)

dic = {'Name of Author' : author_series , 'Number of Acticles' : article_series}

df = pd.DataFrame(dic)
print(df)

  Name of Author  Number of Acticles
0       Jitender                 210
1        Purnima                 211
2          Arpit                 114
3          Jyoti                 178